// Реалізувати вивід в консоль новорічної ялинки (як у одній з попередніх домашок) використовуючи один цикл for. Вам може знадобитися repeat.
// Виведіть парні числа від 2 до 30, за винятком 14, 18. Використати цикл for.
// Реалізувати завдання #2 з циклом while.
// Напишіть цикл, який пропонує prompt ввести число більше за 100. Якщо відвідувач введе інше число – попросити ввести ще раз, і так далі. Цикл повинен запитувати число доти, доки відвідувач не введе число, більше за 100, або не скасує ввід. Ми припускаємо, що відвідувач може вводити не тільки числа. В цьому завданні обов’язково реалізовувати оброблення нечислового введення і пустого рядка. Завдання необхідно виконати у браузері, playground HTML/CSS/JS Starter.
// Просте число – це натуральне число, яке має два дільники (1 і саме число). Напишіть код, який виводить всі прості числа в діапазоні від 2 до n. Для n = 10 результат повинен бути 2, 3, 5, 7. Для вирішення задачі використати вкладені цикли.

/// /Task 1
console.log('Task 1');
for (let i = 0; i < 10; i++) {
  const n = 10;
  const star = '*'.repeat(2 * i + 1);
  const space = ' '.repeat(2 * n - i);
  console.log(space + star);
}

// Task 2
console.log('Task 2');

for (let i = 1; i <= 30; i++) {
  if (i % 2 || i === 14 || i === 16) continue;
  else console.log(i);
}

// Task 3

console.log('Task 3');

let i = 1;
while (i <= 30) {
  i++;
  if (i % 2 || i === 14 || i === 16) continue;
  else console.log(i);
}

// Task 4
console.log('Task 4');
const readlineSync = require('readline-sync');

for (;;) {
  const n = readlineSync.questionFloat('Please enter value for n: ', {
    limit: Number,
  });
  if (+n > 100) break;
  else if (+n < 100) console.log('Invalid number');
}

// for (;;) {
//     let n = prompt('Enter number > 100');
//     if (n === null) break;
//     else if (+n>100) break
//     }

// Task 4
// Просте число – це натуральне число, яке має два дільники (1 і саме число). Напишіть код, який виводить всі прості числа в діапазоні від 2 до n. Для n = 10 результат повинен бути 2, 3, 5, 7. Для вирішення задачі використати вкладені цикли.
console.log('Task 5');
const n = 10;
outer: for (let i = 2; i < n; i++) {
  for (let j = 2; j < i; j++) {
    if (i % j === 0) { continue outer; }
  }
  console.log(i);
}
